export const errorCodes = [
  // 3xx - 重定向,
  {
    code: 301,
    msg: '缓冲的文档还可以继续使用',
  },
  // 4xx - 客户端错误,
  {
    code: 400,
    msg: '无效参数',
  },
  {
    code: 401,
    msg: '登录已过期，请重新登录！', //  "访问被拒绝",
  },
  {
    code: 403,
    msg: '资源不可用。服务器拒绝处理',
  },
  {
    code: 404,
    msg: '请求资源不存在',
  },
  {
    code: 405,
    msg: '请求方法错误',
  },
  {
    code: 406,
    msg: '请求类型不支持',
  },
  {
    code: 407,
    msg: '请先对请求进行授权',
  },
  {
    code: 415,
    msg: '不支持的媒体类型',
  },
  {
    code: 417,
    msg: '执行失败',
  },
  // 5xx - 服务器错误
  {
    code: 500,
    msg: '服务端错误',
  },
  {
    code: 501,
    msg: '服务器不支持该请求方法',
  },
  {
    code: 502,
    msg: '服务器无响应',
  },
  {
    code: 503,
    msg: '服务器无服务',
  },
  {
    code: 504,
    msg: '请求超时',
  },
  {
    code: 505,
    msg: '服务器不支持请求中所指明的HTTP版本',
  },
];
